In [1]:
import pyspark
import pandas as pd

In [3]:
pd.read_csv('sql.csv')

   ID      Name  Age  Salary
0   1       Ali   30    2000
1   2     Ahmed   23     233
2   3  Mohammed   22     123
3   4      Saad   15     100
4   5    Kareem   39    2300

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark = SparkSession.builder.appName('Practise').getOrCreate()

In [6]:
spark

In [7]:
table = spark.read.csv('sql.csv')
table = spark.read.option('header', 'true').csv('sql.csv', inferSchema=True)

In [26]:
table.printSchema()

root
 |-- ID: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [27]:
table.show()

+---+--------+---+------+
| ID|    Name|Age|Salary|
+---+--------+---+------+
|  1|     Ali| 30|  2000|
|  2|   Ahmed| 23|   233|
|  3|Mohammed| 22|   123|
|  4|    Saad| 15|   100|
|  5|  Kareem| 39|  2300|
+---+--------+---+------+

In [28]:
table.select(['Name', 'Age']).show()

+--------+---+
|    Name|Age|
+--------+---+
|     Ali| 30|
|   Ahmed| 23|
|Mohammed| 22|
|    Saad| 15|
|  Kareem| 39|
+--------+---+

In [32]:
table.withColumnRenamed('Name', 'FirstName').show()

+---+---------+---+------+
| ID|FirstName|Age|Salary|
+---+---------+---+------+
|  1|      Ali| 30|  2000|
|  2|    Ahmed| 23|   233|
|  3| Mohammed| 22|   123|
|  4|     Saad| 15|   100|
|  5|   Kareem| 39|  2300|
+---+---------+---+------+

In [40]:
table.withColumn('Tax', table['Salary']*0.2).show()

+---+--------+---+------+-----+
| ID|    Name|Age|Salary|  Tax|
+---+--------+---+------+-----+
|  1|     Ali| 30|  2000|400.0|
|  2|   Ahmed| 23|   233| 46.6|
|  3|Mohammed| 22|   123| 24.6|
|  4|    Saad| 15|   100| 20.0|
|  5|  Kareem| 39|  2300|460.0|
+---+--------+---+------+-----+

In [33]:
removeAge = table.drop('Age')
removeAge.show()

+---+--------+------+
| ID|    Name|Salary|
+---+--------+------+
|  1|     Ali|  2000|
|  2|   Ahmed|   233|
|  3|Mohammed|   123|
|  4|    Saad|   100|
|  5|  Kareem|  2300|
+---+--------+------+

In [36]:
table.filter('Age >= 25').show()

+---+------+---+------+
| ID|  Name|Age|Salary|
+---+------+---+------+
|  1|   Ali| 30|  2000|
|  5|Kareem| 39|  2300|
+---+------+---+------+